//var name = prompt('What is you name?')
//console.log('Hello, ' + name)

//var likesCats = confirm("Тебе нравятся кошки?");
//if (likesCats) {
//    console.log("Ты классная кошка!");
//} else {
//    console.log("Что ж, не проблема. Все равно ты молодец!");
//}

//var words = ['program', 'monkey', 'beautiful', 'frog']
//var word = words[Math.floor(Math.random() * words.length)]

//var answerarray = []
//for (i = 0; i < word.length; i++) {
//    answerarray[i] = '_'
//}
//var remainingletters = word.length

//while (remainingletters > 0) {
//    alert(answerarray.join(' '))
//    var guess = prompt('guess a letter or press cancel to leave the game.')
//    if (guess === null) {
//        break
//    } else if (guess.length !== 1) {
//        alert('please, enter just one character.')
//    } else {
//        for (j = 0; j < word.length; j++) {
//            if (word[j] === guess) {
//                answerarray[j] = guess
//                remainingletters--
//            }
//        }

//    }
//}

//alert(answerarray.join(' '))
//alert('perfect you guess: ' + word)

//-----------------------------------------------------------


//-----------------------------------------------------------

alert('Висильница!' + '\n' + 'Моя первая \'игра\' сделана только на: js code. ' + '\n' + 'Нажми \'ok\' чтобы начать.')
if (confirm('Желал бы ты играть с уменьшиным количеством жизней?' + '\n' + 'Если ты согласен, то нажми \'ok\'')) {
    var lives = 8
} else {
    var lives = 16
}
var words = [
    "способность", "способный", "на борту", "около", "выше", "принять", "авария", "согласно",
    "счет", "точный", "акры", "поперек", "действие", "действие", "активный", "активность",
    "актуальный", "фактически", "добавить", "дополнение", "дополнительный", "прилагательное", "взрослый", "приключение",
    "совет", "аффект", "боязнь", "после", "после полудня", "снова", "против", "возраст",
    "назад", "согласен", "впереди", "помощь", "воздух", "самолет", "одинаково", "жив",
    "все", "разрешить", "почти", "в одиночку", "вместе", "вслух", "алфавит", "уже",
    "также", "хотя", "я", "среди", "количество", "древний", "угол", "злой",
    "животное", "объявил", "другой", "ответ", "муравьи", "любой", "кто угодно", "кто угодно",
    "все", "все равно", "где угодно", "отдельно", "квартира", "внешний вид", "яблоко", "применено",
    "уместно", "есть", "площадь", "вооружение", "армия", "вокруг", "устроить", "расставить",
    "прибыть", "стрелка", "искусство", "статья", "как", "в сторону", "спросить", "спит",
    "при", "съел", "атмосфера", "атом", "атомный", "прикрепленный", "атака", "попытка",
    "внимание", "аудитория", "автор", "автомобиль", "доступный", "средний", "избегать", "осведомленный",
    "прочь", "малыш", "спина", "плохо", "плохо", "мешок", "баланс", "мяч",
    "воздушный шар", "полоса", "банка", "бар", "голый", "кора", "сарай", "основание",
    "бейсбол", "базовый", "базис", "корзина", "летучая мышь", "битва", "быть", "боб",
    "медведь", "бить", "красиво", "красавица", "стал", "потому что", "стать", "стать",
    "пчела", "был", "до", "начало", "начало", "начало", "поведение", "позади",
    "быть", "верил", "колокол", "принадлежать", "внизу", "пояс", "изгиб", "внизу",
    "изогнутый", "рядом", "лучший", "ставка", "лучше", "между", "за пределами", "велосипед",
    "больше", "самый большой", "счет", "птицы", "рождение", "день рождения", "укус", "укус",
    "черный", "пустой", "одеяло", "дул", "слепой", "блок", "кровь", "удар",
    "синий", "доска", "лодка", "тело", "кость", "книга", "бордюр", "рожденный",
    "оба", "бутылка", "дно", "переплет", "лук", "чаша", "коробка", "мальчик",
    "мозг", "ветка", "латунь", "храбрый", "хлеб", "перерыв", "завтрак", "дыхание",
    "дышать", "дышать", "ветерок", "кирпич", "мостик", "кратко", "ярко", "приносить",
    "широкий", "сломанный", "сломанный", "брат", "принесенный", "коричневый", "кисть", "буйвол",
    "построить", "построить", "построить", "закопать", "сжечь", "лопнуть", "автобус", "куст",
    "бизнес", "занято", "но", "масло", "купить", "по", "каюта", "клетка",
    "торт", "звонок", "штиль", "пришла", "камера", "лагерь", "банка", "канал",
    "не может", "кепка", "капитал", "капитан", "захваченный", "автомобиль", "карбон", "карта",
    "заботиться", "бережно", "бережно", "нести", "носить", "футляр", "литье", "замок",
    "кот", "улов", "скот", "пойманный", "причина", "пещера", "клетка", "цент",
    "центр", "центральный", "век", "определенный", "непременно", "цепочка", "стул", "палата",
    "шанс", "изменение", "изменение", "глава", "персонаж", "характеристика", "заряд", "диаграмма",
    "чек", "сыр", "химикат", "сундук", "курица", "начальник", "ребенок", "дети",
    "выбор", "выбрать", "выбрал", "избранный", "церковь", "круг", "цирк", "гражданин",
    "город", "класс", "класс", "когти", "глина", "чистый", "чистый", "четко",
    "климат", "лазить", "часы", "близко", "близко", "ближе", "ткань", "одежда",
    "одежда", "облако", "клуб", "тренер", "уголь", "берег", "пальто", "кофе",
    "холодный", "собрать", "колледж", "колония", "цвет", "столбец", "комбинация", "объединить",
    "приходи", "удобно", "приходи", "команда", "обычное", "сообщество", "компания", "сравнивай",
    "компас", "полный", "полностью", "сложный", "составной", "составной", "составной", "заинтересованный",
    "состояние", "съезд", "связан", "рассматривать", "состоять", "согласный", "постоянно", "построение",
    "содержать", "континент", "продолжение", "контраст", "контроль", "разговор", "готовить", "печенье",
    "круто", "медь", "копия", "кукуруза", "уголок", "правильно", "правильно", "стоимость",
    "хлопок", "умел", "посчитать", "страна", "пара", "храбрость", "курс", "суд",
    "крышка", "корова", "ковбой", "трещина", "сливки", "создание", "существо", "команда",
    "урожай", "крест", "толпа", "крик", "чашка", "любопытный", "ток", "кривая",
    "таможня", "резка", "резка", "повседневность", "порча", "танец", "опасность", "опасно",
    "тьма", "тьма", "свидание", "дочь", "рассвет", "день", "мертвый", "сделка",
    "дорогой", "смерть", "решить", "объявить", "глубоко", "глубоко", "олень", "определение",
    "степень", "зависеть", "глубина", "описать", "пустыня", "дизайн", "стол", "деталь",
    "определить", "развить", "развернуть", "диаграмму", "диаметр", "сделать", "умереть", "разниться",
    "разница", "другой", "сложный", "сложный", "копать", "ужин", "прямой", "направление",
    "прямо", "грязь", "грязный", "исчезновение", "обнаружение", "открытие", "обсуждение", "обсуждение",
    "болезнь", "блюдо", "расстояние", "дальний", "разделить", "разделить", "до", "врач",
    "делает", "собака", "делает", "кукла", "доллар", "готово", "осел", "дверь",
    "точка", "двойник", "сомнение", "вниз", "дюжина", "ничья", "нарисованная", "мечта",
    "одеваться", "рисовать", "сушить", "пить", "ездить", "ездить", "водить", "за рулем",
    "капля", "упал", "погнал", "сухой", "утка", "из-за",
];
var word = words[Math.floor(Math.random() * words.length)]
var answerArray = []
for (i = 0; i < word.length; i++) {
    if (word[i] != ' ') {
        answerArray[i] = '_';
    }
    else {
        answerArray[i] = ' ';
    }
}

for (var i = remainingLetters = 0; i < word.length; remainingLetters += +(" " !== word[i++]));

//var remainingLetters = word.length - word.length - word.count(" ")
var newRemainigLetters = remainingLetters


while ((remainingLetters > 0) && (lives !== 0)) {
    alert('Количество жизней: ' + lives + '\n' + answerArray.join(' ') + '\n' + remainingLetters + ' букв осталось')
    var guess = prompt('Отгадай букву в слове или нажми \"cancel\" чтобы выйти из игры.')
    guess = guess.toLowerCase()
    if (guess === null) {
        if (confirm('Может быть ты еще захочешь поиграть...')) {
            document.location.reload()
        }
        break
    } else if (guess.length !== 1 && guess !== word) {
        alert('Пожалуйста, введи одну букву.')
        lives++
    } else {
        for (j = 0; j < word.length; j++) {
            if (answerArray[j] === guess) {
                alert('Ты уже отгодал эту букву... попробуй другую.')
                lives++
                break
            }
            if (word[j] === guess) {
                answerArray[j] = guess
                remainingLetters--
            }
            if (guess === word) {
                remainingLetters = 0
            }


        }

    }
    if (remainingLetters === newRemainigLetters) {
        lives--
    }
    newRemainigLetters = remainingLetters
}

if (lives === 0) {
    alert('Ты потратив все свои жизни. ' + '\n' + 'Секретное слово было: ' + '\'' + word + '\'.')
} else if (remainingLetters === 0) {
    if (confirm('Молодец! ты отгодал слово: ' + '\'' + word + '\'.' + '\n' + 'Если хочешь сыграть еще, нажм \'ok\'')) {
        document.location.reload()
    }
} else {
    alert('Made by \'Sergey\'.')
}

//alert(answerArray.join(' '))






